Revit 2026 API

# StoneStoneApplication Property

---

The property labeled "Finish" from the "Stone" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string StoneApplication { get; }
```
```vb
Public Shared ReadOnly Property StoneApplication As String
	Get
```
```cpp
public:
static property String^ StoneApplication {
	String^ get ();
}
```
```fsharp
static member StoneApplication : string with get
```

#### Property Value

String

This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "StoneApplicationType".

#### Reference

Stone Class

Autodesk.Revit.DB.Visual Namespace